<?php
defined('BASEPATH') OR exit('No direct script access allowed');

/*
| -------------------------------------------------------------------
| Redis 连接配置
| -------------------------------------------------------------------
| 这个文件配置了连接Redis服务器的相关配置信息
|
| -------------------------------------------------------------------
| 说明：
| -------------------------------------------------------------------
|
|	['hostname'] Redis服务器的主机地址，或者是unix域套接字的路径。
|   ['port']     端口号。默认6379。
|   ['timeout']  超时时间，浮点类型，单位秒。默认是0，表示无超时时间。
|   ['pconnect'] TRUE或FALSE - 是否使用持久连接。
|	['password'] 连接Redis的密码，密码在网络中是明文传递的。
*/

$config = array(
	'hostname'	=> '127.0.0.1',
	'port' => '6379',
	'timeout' => '0',
	'pconnect' => FALSE,
	'password' => '',
);
